app/Models/manage/Discount_model.php

SELECT *
FROM `shop_discount`
---
    public function getdiscount($id = false)
    {
        if($id === false){
            return $this->findAll();