app/Models/manage/Seo_model.php

    public function saveseo($data)
    {
        $query = $this->db->table($this->table)->insert($data);
---
INSERT INTO `seo` (`meta_title`, `meta_description`, `content_type`, `content_id`) VALUES ('Giới thiệu', 'Giới thiệu', 'page', 1)