app/Models/manage/Shop_Order_model.php

SELECT `shop_order`.*, `shop_customer`.`name` as `cus_name`
FROM `shop_order`
JOIN `shop_customer` ON `shop_customer`.`id` = `shop_order`.`user_id`
ORDER BY `created_at` DESC
---
    public function getShoporder($id = false)
    {
        if($id === false){
                $db = \Config\Database::connect();
                $builder = $db->table('shop_order');
                $builder->select('shop_order.*, shop_customer.name as cus_name');
                $builder->join('shop_customer', 'shop_customer.id = shop_order.user_id');
                $builder->orderBy("created_at", "desc");
                $query = $builder->get();