app/Models/manage/Shop_Product_model.php

SELECT `shop_product`.*
FROM `shop_product`
ORDER BY `id` DESC
---
    public function getshopproduct($id = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);

        if ($id === false) {
            $builder->select('shop_product.*');
            $builder->orderBy('id', 'DESC');
            $query = $builder->get();