app/Models/manage/Shop_Customer_model.php

    public function getcustomer($id = false)
    {
        $db  = \Config\Database::connect();
        $builder = $db->table('shop_customer');
        if($id === false){
            $builder->select('shop_customer.*, tinhthanhpho.name as ttp');
            $builder->join('tinhthanhpho', 'shop_customer.matp = tinhthanhpho.matp');
            $query = $builder->get();
---
SELECT `shop_customer`.*, `tinhthanhpho`.`name` as `ttp`
FROM `shop_customer`
JOIN `tinhthanhpho` ON `shop_customer`.`matp` = `tinhthanhpho`.`matp`