app/Models/frontend/Banner_model.php

    public function getbanner($id = false)
    {
        if($id === false){
            return $this->findAll();
---
SELECT *
FROM `shop_banner`