app/Models/frontend/City_model.php

    public function getCity(){
        $db      = \Config\Database::connect();
        $builder = $db->table('tinhthanhpho');
        $query = $builder->get();
---
SELECT *
FROM `tinhthanhpho`