app/Models/frontend/Info_model.php

    public function getInfo(){
        $db      = \Config\Database::connect();
        $builder = $db->table('info');
        $builder->where('id', 1);
        $query = $builder->get();
---
SELECT *
FROM `info`
WHERE `id` = 1