app/Models/frontend/Menu_model.php

SELECT `menu`.*, `menu_item`.`json` as `json`
FROM `menu`
JOIN `menu_item` ON `menu`.`id` = `menu_item`.`menu_id`
WHERE `menu`.`code` = 'main'
---
    public function getmenu($code)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('menu');
        $builder->select('menu.*, menu_item.json as json');
        $builder->join('menu_item', 'menu.id = menu_item.menu_id');
        $builder->where('menu.code', $code);
        $query = $builder->get();