app/Models/frontend/NotificationsShow_model.php

    public function getId($user_id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('noti_id');
        $builder->where('id_user', $user_id);
        $query = $builder->get();
---
SELECT `noti_id`
FROM `noti_show`
WHERE `id_user` = '1'