app/Models/frontend/Notifications_model.php

    public function getNotiUnRead($id)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('noti.*');
        $builder->join('noti_status', 'noti_status.noti_id = noti.id', 'left');
        $builder->whereNotIn('noti.id', $id );
        $query = $builder->get();
---
SELECT `noti`.*
FROM `noti`
LEFT JOIN `noti_status` ON `noti_status`.`noti_id` = `noti`.`id`
WHERE `noti`.`id` NOT IN ('1')

    public function getNotiUnShow($id)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('noti.*');
        $builder->join('noti_show', 'noti_show.noti_id = noti.id', 'left');
        $builder->whereNotIn('noti.id', $id );
        $query = $builder->get();
---
SELECT `noti`.*
FROM `noti`
LEFT JOIN `noti_show` ON `noti_show`.`noti_id` = `noti`.`id`
WHERE `noti`.`id` NOT IN ('1','2')