app/Models/frontend/Option_model.php

SELECT *
FROM `options`
---
    public function getOptions($id = false)
    {
        if($id === false){
            return $this->findAll();