app/Models/frontend/Popup_model.php

    public function getPopup($id = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);

        if($id === false){
            $builder->orderBy('id', 'DESC');
            $query = $builder->get();
---
SELECT *
FROM `popup`
ORDER BY `id` DESC