app/Models/frontend/Shop_Product_model.php

SELECT `shop_product`.*, `shop_producer`.`name` as `proc_name`, `shop_category`.`title` as `cat_name`, `shop_discount`.`title`, `shop_discount`.`id` as `dcid`, `shop_discount`.`ratio`, `shop_discount`.`slug` as `dslug`, `shop_discount`.`money`, `shop_discount`.`from_date`, `shop_discount`.`to_date`
FROM `shop_product`
JOIN `shop_producer` ON `shop_producer`.`id` = `shop_product`.`producer_id`
JOIN `shop_category` ON `shop_category`.`id` = `shop_product`.`category_id`
JOIN `shop_discount` ON `shop_discount`.`id` = `shop_product`.`id_discount`
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function getArrivalsProduct($limit){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_product');
        $builder->select('shop_product.*, shop_producer.name as proc_name, shop_category.title as cat_name,shop_discount.title, shop_discount.id as dcid, shop_discount.ratio, shop_discount.slug as dslug,shop_discount.money, shop_discount.from_date, shop_discount.to_date ');
        $builder->join('shop_producer', 'shop_producer.id = shop_product.producer_id');
        $builder->join('shop_category', 'shop_category.id = shop_product.category_id');
        $builder->join('shop_discount', 'shop_discount.id = shop_product.id_discount');
        $builder->orderBy("created_at", "desc");
        $builder->limit($limit);
        $query = $builder->get();

SELECT `shop_product`.*, `shop_producer`.`name` as `proc_name`, `shop_category`.`title` as `cat_name`, `shop_discount`.`title`, `shop_discount`.`id` as `dcid`, `shop_discount`.`ratio`, `shop_discount`.`slug` as `dslug`, `shop_discount`.`money`, `shop_discount`.`from_date`, `shop_discount`.`to_date`
FROM `shop_product`
JOIN `shop_producer` ON `shop_producer`.`id` = `shop_product`.`producer_id`
JOIN `shop_category` ON `shop_category`.`id` = `shop_product`.`category_id`
JOIN `shop_discount` ON `shop_discount`.`id` = `shop_product`.`id_discount`
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function getFeaturedProduct($limit){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_product');
        $builder->select('shop_product.*, shop_producer.name as proc_name, shop_category.title as cat_name,shop_discount.title, shop_discount.id as dcid, shop_discount.ratio, shop_discount.slug as dslug,shop_discount.money, shop_discount.from_date, shop_discount.to_date ');
        $builder->join('shop_producer', 'shop_producer.id = shop_product.producer_id');
        $builder->join('shop_category', 'shop_category.id = shop_product.category_id');
        $builder->join('shop_discount', 'shop_discount.id = shop_product.id_discount');
        $builder->orderBy("created_at", "desc");
        $builder->limit($limit);
        $query = $builder->get();

SELECT `shop_product`.*, `shop_producer`.`name` as `proc_name`, `shop_category`.`title` as `cat_name`, `shop_discount`.`title`, `shop_discount`.`id` as `dcid`, `shop_discount`.`ratio`, `shop_discount`.`slug` as `dslug`, `shop_discount`.`money`, `shop_discount`.`from_date`, `shop_discount`.`to_date`
FROM `shop_product`
JOIN `shop_producer` ON `shop_producer`.`id` = `shop_product`.`producer_id`
JOIN `shop_category` ON `shop_category`.`id` = `shop_product`.`category_id`
JOIN `shop_discount` ON `shop_discount`.`id` = `shop_product`.`id_discount`
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function getMostSaleProduct($limit){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_product');
        $builder->select('shop_product.*, shop_producer.name as proc_name, shop_category.title as cat_name,shop_discount.title, shop_discount.id as dcid, shop_discount.ratio, shop_discount.slug as dslug,shop_discount.money, shop_discount.from_date, shop_discount.to_date ');
        $builder->join('shop_producer', 'shop_producer.id = shop_product.producer_id');
        $builder->join('shop_category', 'shop_category.id = shop_product.category_id');
        $builder->join('shop_discount', 'shop_discount.id = shop_product.id_discount');
        $builder->orderBy("created_at", "desc");
        $builder->limit($limit);
        $query = $builder->get();

SELECT *
FROM `shop_category`
---
    public function getAllCategory(){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_category');
        $query = $builder->get();

SELECT `shop_product`.*, `shop_discount`.`title`, `shop_discount`.`id` as `dcid`, `shop_discount`.`ratio`, `shop_discount`.`slug` as `dslug`, `shop_discount`.`money`, `shop_discount`.`from_date`, `shop_discount`.`to_date`
FROM `shop_product`
JOIN `shop_discount` ON `shop_discount`.`id` = `shop_product`.`id_discount`
---
    public function getAllProduct(){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_product');
        $builder->select('shop_product.*,shop_discount.title, shop_discount.id as dcid, shop_discount.ratio, shop_discount.slug as dslug,shop_discount.money, shop_discount.from_date, shop_discount.to_date ');
        $builder->join('shop_discount', 'shop_discount.id = shop_product.id_discount');
        $query = $builder->get();