app/Models/frontend/Shop_Category_model.php

SELECT `shop_category`.*, count(shop_product.id) as count
FROM `shop_category`
JOIN `shop_product` ON `shop_category`.`id` = `shop_product`.`category_id`
GROUP BY `shop_category`.`id`
---
    public function getShopCategory(){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_category');
        $builder->select('shop_category.*, count(shop_product.id) as count ');
        $builder->join('shop_product', 'shop_category.id = shop_product.category_id');
        $builder->groupBy('shop_category.id');
        $query = $builder->get();