app/Models/frontend/Shop_Customer_model.php

    public function getCustomer($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `shop_customer`
WHERE `id` = '1'