app/Models/frontend/Shop_Slider_model.php

SELECT *
FROM `slider`
---
    public function getSlider(){
        $db      = \Config\Database::connect();
        $builder = $db->table('slider');
        $query = $builder->get();