app/Models/frontend/Ui_model.php

    public function getUi(){
        $db      = \Config\Database::connect();
        $builder = $db->table('shop_ui');
        $builder->where('id', 1);
        $query = $builder->get();
---
SELECT *
FROM `shop_ui`
WHERE `id` = 1